*** DONE download with magit like popup interface -- ~emms-bilibili-download-track~
CLOSED: [2018-02-23 Fri 22:51]
:LOGBOOK:
- State "DONE"       from "STARTED"    [2018-02-23 Fri 22:51]
CLOCK: [2018-01-30 Tue 11:11]--[2018-02-03 Sat 10:07] => 94:56
- State "STARTED"    from "TODO"       [2018-01-29 Mon 17:31]
CLOCK: [2018-01-29 Mon 17:31]--[2018-01-29 Mon 19:07] =>  1:36
- State "TODO"       from              [2018-01-29 Mon 15:40]
:END:

**** DONE [#A] async-start-process process buffer killed automatically issue [4/4]
CLOSED: [2018-02-10 Sat 21:57] DEADLINE: <2018-01-29 Mon>
:LOGBOOK:
- State "DONE"       from "STARTED"    [2018-02-10 Sat 21:57]
- State "STARTED"    from "BUG"        [2018-01-29 Mon 15:12]
- State "BUG"        from "DONE"       [2018-01-29 Mon 15:01]
- State "DONE"       from "STARTED"    [2018-01-29 Mon 14:57]
- State "STARTED"    from "TODO"       [2018-01-29 Mon 14:51]
CLOCK: [2018-01-29 Mon 14:51]--[2018-01-29 Mon 14:57] =>  0:06
- State "TODO"       from              [2018-01-29 Mon 01:09]
:END:

- [X] test
  - [X] one download
  - [X] multiple downloads
    - [X] async process sentinel can't delete process buffer with "<2>" suffix etc.

*** DONE [#A] integrate youtube-dl-emacs into emms-bilibili [9/9]
CLOSED: [2018-02-12 Mon 15:51] DEADLINE: <2018-02-10 Sat>
:LOGBOOK:
- State "DONE"       from "STARTED"    [2018-02-12 Mon 15:51] \\
  basic support finished. Just some Bilibili URLs downloading seems always failed. Don't know why.
CLOCK: [2018-02-12 Mon 14:48]--[2018-02-12 Mon 15:51] =>  1:03
CLOCK: [2018-02-12 Mon 10:51]--[2018-02-12 Mon 14:45] =>  3:54
- Not scheduled, was "[2018-02-08 Thu]" on [2018-02-10 Sat 21:58]
CLOCK: [2018-02-08 Thu 23:42]--[2018-02-08 Thu 23:54] =>  0:12
CLOCK: [2018-02-08 Thu 23:12]--[2018-02-08 Thu 23:37] =>  0:25
CLOCK: [2018-02-08 Thu 22:42]--[2018-02-08 Thu 23:07] =>  0:25
CLOCK: [2018-02-08 Thu 14:57]--[2018-02-08 Thu 14:58] =>  0:01
CLOCK: [2018-02-08 Thu 13:52]--[2018-02-08 Thu 14:28] =>  0:36
- State "STARTED"    from "CODE"       [2018-02-08 Thu 12:32]
CLOCK: [2018-02-08 Thu 12:32]--[2018-02-08 Thu 13:17] =>  0:45
- State "CODE"       from              [2018-02-08 Thu 12:32]
:END:

- [X] check out README
- [X] check out source code
- [X] possible to integrate into emms-bilibili?
  - [X] yes
- [X] modify code

- [X] get video id with ~youtube-dl --get-id~.

#+begin_src shell
youtube-dl --get-id "https://www.bilibili.com/video/av19206955/"
#+end_src

#+RESULTS[<2018-02-08 13:24:20> 991d77d252f8e7eae7625eff4c4f556e0e66b632]:
: 19206955

#+begin_src emacs-lisp
(prin1 (with-temp-buffer
         (call-process
          "youtube-dl"
          nil t nil
          "--get-id" "https://www.bilibili.com/video/av19206955/")
         (buffer-string)))
#+end_src

#+RESULTS[<2018-02-08 13:51:11> a06650f24b799eccca4031ddf7472c545ee42da8]:
: 19206955

- [X] need to prefix id number with a prefix like "youtube-" or "bilibili-"

#+begin_src emacs-lisp
(let ((id (concat "bilibili-" id-number)))
  )
#+end_src

- [X] get filename with ~--get-filename~

#+begin_src shell
youtube-dl --get-filename "https://www.bilibili.com/video/av19206955/"
#+end_src

#+RESULTS[<2018-02-08 13:52:54> 2dd90f247e039802b0f5780178038bde0d6884e1]:
: 【番声】大胸妹怎么了？大胸妹吃你家大米了？-19206955.mp4

- [X] get title with ~youtube-dl --get-title~.

#+begin_src shell
youtube-dl --get-title "https://www.bilibili.com/video/av19206955/"
#+end_src

#+RESULTS[<2018-02-08 13:23:46> a4b9d5198525c38bf9d3775d4e9ea891b7f98e29]:
: 【番声】大胸妹怎么了？大胸妹吃你家大米了？

** DONE emms user bookmarks list support [6/6]
CLOSED: [2018-02-23 Fri 22:37] SCHEDULED: <2018-02-12 Mon>
:LOGBOOK:
- State "DONE"       from "STARTED"    [2018-02-23 Fri 22:37]
CLOCK: [2018-02-23 Fri 22:24]--[2018-02-23 Fri 22:37] =>  0:13
CLOCK: [2018-02-23 Fri 09:51]--[2018-02-23 Fri 10:41] =>  0:50
CLOCK: [2018-02-22 Thu 19:11]--[2018-02-22 Thu 21:05] =>  1:54
CLOCK: [2018-02-22 Thu 18:23]--[2018-02-22 Thu 18:24] =>  0:01
- State "STARTED"    from "NEXT"       [2018-02-22 Thu 15:19]
CLOCK: [2018-02-22 Thu 15:19]--[2018-02-22 Thu 18:16] =>  2:57
- State "NEXT"       from "TODO"       [2018-02-11 Sun 22:33]
- State "TODO"       from              [2018-01-29 Mon 15:41]
:END:

